'''
		1. Создать программно файл в текстовом формате, записать в него построчно данные, вводимые пользователем.
		Об окончании ввода данных свидетельствует пустая строка.
'''

while True:
    with open('hm1.txt', 'a') as data:
        stroka = input("Введите текст: ")

        if not stroka:
            break

        data.write(f"{stroka}\n")






'''
		2. Создать текстовый файл (не программно), сохранить в нем несколько строк,
		выполнить подсчет количества строк, количества слов в каждой строке.
'''


with open('file.txt') as f:
    stroki = f.readlines()
    print(f"Количество строк в тексте : {len(stroki)}")
    words = f.seek(0, 0)
    words = f.readlines()
    y = 0
    for x in words:
        y +=1
        print(f" В {y} строке количество слов : {len(x.split())}")







'''
		3. Создать текстовый файл (не программно),
		 построчно записать фамилии сотрудников и величину их окладов (не менее 10 строк).
 		Определить, кто из сотрудников имеет оклад менее 20 тыс., вывести фамилии этих сотрудников.
 		 Выполнить подсчет средней величины дохода сотрудников.
		Пример файла:

Иванов 23543.12
Петров 13749.32

		Мой пример:
Ivanov 10250.92
Petrov 15345.16
Karas 24005.94
Petyhov 9845.73
Oleynikov 23256.53
Prihodko 25854.75
Verbickiy 15846.35
Nekrasov 13254.98
Kashiro 12354.56
Zakrevskiy 9512.21
Evmyshkov 20253.63
'''


spisok = []
spisok2 = []
with open('file.txt') as sal:
    salary = sal.readlines()
    for x in salary:
        y = x.split()
        if float(y[1]) < 20000:
            print(y[0])

    middle = sal.seek(0, 0)
    middle = sal.readlines()
    for u in middle:
        i = u.split()
        n = i[1]
        spisok2.append(n)
    summa = (((sum(map(float, spisok2))))// len(spisok2))
    print(f"Средний доход сотрудников = {summa}")







'''
		4. Создать (не программно) текстовый файл со следующим содержимым:
One — 1
Two — 2
Three — 3
Four — 4

		Необходимо написать программу, открывающую файл на чтение и считывающую построчно данные.
		При этом английские числительные должны заменяться на русские. Новый блок строк должен записываться в новый текстовый файл.
'''

numbers = {"One": "Один", "Two": "Два", "Three": "Три", "Four": "Четыре"}
new_numbers = []


with open('file2.txt') as file:
    for x in file:
        x = x.split(' - ')
        new_numbers.append(numbers[x[0]] + ' - ' + x[1])
    print(new_numbers)

with open('file3.txt', 'w') as file3:
    file3.writelines(new_numbers)








'''
		5. Создать (программно) текстовый файл, записать в него программно набор чисел, разделенных пробелами.
		Программа должна подсчитывать сумму чисел в файле и выводить ее на экран.
'''
numbers = [x for x in range(0, 10)]
with open('file4.txt', 'w') as file4:
    file4.write(" ".join(map(str, numbers)))


with open('file4.txt') as file4s:
    summa = file4s.read()
    summa = summa.split()
    summa = sum(map(int, summa))
    print(f"Сумма чисел: {summa}")







'''
		6. Необходимо создать (не программно) текстовый файл, где каждая строка описывает учебный предмет и наличие лекционных,
 		практических и лабораторных занятий по этому предмету и их количество.
 		Важно, чтобы для каждого предмета не обязательно были все типы занятий.
 		Сформировать словарь, содержащий название предмета и общее количество занятий по нему. Вывести словарь на экран.
Примеры строк файла: Информатика: 100(л) 50(пр) 20(лаб).
Физика: 30(л) — 10(лаб)
Физкультура: — 30(пр) —
Пример словаря: {“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}

Мой пример:
Informatika: 100(l) 50(pr) 20(lab)
Fizika: 30(l) - 10(lab)
Fiskultura: - 30(pr) -
Russkiy: 30(l) 30(pr) -
Biologiya: - 15(pr) 2(lab)
'''

slovar = {}
with open('file5.txt') as file5:
    for i in file5:
        spl = i.split()
        name = spl[0].rsplit(':')
        slovar[name[0]] = spl[1:]
print(slovar)

slovarsum = {}
for key, value in slovar.items():

    slovarsum[key] = sum(
        [
            int(itog[:itog.index('(')])
            for itog in value
            if itog != '-'
        ]
    )

print(slovarsum)








'''
		7. Создать вручную и заполнить несколькими строками текстовый файл,
		в котором каждая строка должна содержать данные о фирме: название, форма собственности, выручка, издержки.
Пример строки файла: firm_1 ООО 10000 5000.

		Необходимо построчно прочитать файл, вычислить прибыль каждой компании, а также среднюю прибыль.
		Если фирма получила убытки, в расчет средней прибыли ее не включать.
		Далее реализовать список. Он должен содержать словарь с фирмами и их прибылями, а также словарь со средней прибылью.
		Если фирма получила убытки, также добавить ее в словарь (со значением убытков).
Пример списка: [{“firm_1”: 5000, “firm_2”: 3000, “firm_3”: 1000}, {“average_profit”: 2000}].

		Итоговый список сохранить в виде json-объекта в соответствующий файл.
Пример json-объекта:

[{"firm_1": 5000, "firm_2": 3000, "firm_3": 1000}, {"average_profit": 2000}]
'''
import json
my_dict = {}
res_profit = 0
with open('file7.txt') as file7:
    for x in file7:

        x = x.split()
        y = int(x[2]) - int(x[3])

        if y < 0:
            print(f"Компания {x[0]} отработала в убыток: {y}")
            low = y
            my_dict.update({x[0]:y})
        else:

            res_profit = res_profit + y
            my_dict.update({x[0]:y})
            print(f"Прибыль компании: {x[0]} = {y}")
print(f"Средняя прибыль компаний: {res_profit}")
avg_dict = {}
avg_dict.update({"average_profit":res_profit})
spisok = []
spisok.append(my_dict)
spisok.append(avg_dict)
print(spisok)


with open('spisok.json', 'w') as file7:
    json.dump(spisok, file7)


























